Repository: Bluewolf787/autospotify
Catalog: lib/l10n/app_*.arb
Languages: de, fr

# btnGo
source: go
de: los
fr: allez-y

# btnNext
source: next
de: weiter
fr: Suivant

# btnFinish
source: finish
de: fertigstellen
fr: finir

# btnBack
source: Back
de: Zurück
fr: Retourner

# btnLight
source: Light
de: Hell
fr: Brillant

# btnDark
source: Dark
de: Dunkel
fr: Sombre

# btnYes
source: yes
de: ja
fr: oui

# btnNo
source: no
de: nein
fr: non

# btnTryAgain
source: try again
de: Erneut versuchen
fr: réessayer

# btnConnectSpotify
source: Connect Spotify
de: Spotify verbinden
fr: Connecter Spotify

# spotifyTextField
source: Hello,
de: Hallo,
fr: Salut,

# ytHintText
source: Enter your YouTube playlist URL
de: Gib deine YouTube Playlist URL ein
fr: Donnes l'URL de votre liste de lecture YouTube

# clearToolTip
source: Clear
de: Löschen
fr: Supprimer

# changeThemeToolTip
source: Change theme
de: Ändere das Farbschema
fr: Modifier le jeu de couleurs

# unexpectedError
source: Oops! Something unexpected happened
de: Ups! Etwas lief anders als erwartet
fr: Oups! Quelque chose d'inattendu est arrivé

# spotifySaveError
source: Failed to save the credentials
de: Speichern der Spotify Anmeldeinformationen fehlgeschlagen
fr: Échec de l'enregistrement des informations d'identification de Spotify

# somthingWrongError
source: Oops! Something went wrong. Please try again
de: Ups! Etwas ist schiefgelaufen. Bitte versuche es erneut
fr: Oups! Quelque chose s'est mal passé. Veuillez réessayer

# spotifyConnectError
source: Failed to connect to Spotify
de: Verbinden zu Spotify fehlgeschlagen
fr: Échec de la connexion à Spotify

# syncingError
source: Oops! Something went wrong while syncing
de: Ups! Beim synchronisieren ist etwas schiefgelaufen
fr: Oups! Un problème est survenu lors de la synchronisation

# noSongsFoundError
source: Cloud not find any songs in that YouTube playlist
de: In der YouTube playlist konnten keine Lieder gefunden werden
fr: Cloud ne trouve pas de chansons dans cette liste de lecture YouTube

# gettingYtPlaylistError
source: Oops! Something went wrong while getting the YouTube playlist. Please check the provided URL
de: Ups! Beim finden der YouTube Playlist ist etwas schiefgelaufen. Bitte überprüfe die angegebene Playlist URL
fr: Oups ! Un problème est survenu lors de l'obtention de la liste de lecture YouTube. Veuillez vérifier l'URL fournie

# ytUrlInvalid
source: The provided YouTube playlist URL is not valid
de: Die angegebene YouTube Playlist URL ist ungültig
fr: L'URL de la liste de lecture YouTube spécifiée n'est pas valide

# connectSpotifyFirstWarning
source: Please connect your Spotify profile with AutoSpotify before move on
de: Bitte verbinde dein Spotify Profil mit AutoSpotify bevor du weiter machst
fr: Veuillez connecter votre profil Spotify avec AutoSpotify avant de continuer

# songsAlreadyInPlaylistWarning
source: Those songs are already in that Spotify playlist
de: Die Lieder aus der YouTube Playlist sind bereits in der Spotify Playlist
fr: Les chansons de la liste de lecture YouTube sont déjà dans la liste de lecture Spotify

# noYtPlaylistWarning
source: Please enter a YouTube playlist
de: Bitte gib eine YouTube Playlist an
fr: Veuillez entrer une liste de lecture YouTube

# successfulSync
source: Playlists successfully synced
de: Die Playlisten wurden erfolgreich synchronisiert
fr: Les listes de lecture ont été synchronisées avec succès

source: no network connection
de: keine Internetverbindung
fr: pas de connexion internet

# exitHeader
source: Exit AutoSpotify
de: AutoSpotify beenden
fr: Quitter AutoSpotify

# exitContent
source: Are you sure to exit?
de: Bist du sicher, dass du beenden möchtest?
fr: Tu es sûr de vouloir arrêter?

# introStartSpan1
source: Before you can use
de: Bevor du mit
fr: Avant de pouvoir utiliser

# introStartSpan2
source: to automatically generate
de: Playlisten automatisch in
fr: pour générer automatiquement des listes de lecture dans

# introStartSpan3
source: playlists, you need to do some steps first
de: generieren kannst, musst du vorher noch ein paar Schritte tun
fr: , vous devez d'abord effectuer quelques démarches

# chooseThemeSpan1
source: Choose your favorite color
de: Wähle dein bevorzugtes
fr: Choisissez votre

# chooseThemeSpan2
source: theme
de: Farbschema
fr: schéma de couleurs

# introSpotifySpan1
source: You must authorize
de: Du musst
fr: Vous devez autoriser

# introSpotifySpan2
source: to connect to your
de: autorisieren sich mit deinen
fr: à se connecter à votre profil

# introSpotifySpan3
source: account
de: Profil zu verbinden

# introYtSpan1
source: And provide a
de: Zuletzt, gib deine
fr: Enfin, indiquez la liste de lecture

# introYtSpan2
source: playlist you want to synchronize
de: Playlist an, die du synchronisieren möchtest
fr: que vous souhaitez synchroniser

# homePageSpan1
source: Add Songs from
de: Füge Lieder aus
fr: Ajoutez automatiquement les chansons des listes de lecture

# homePageSpan2
source: playlists automatically to your
de: Playlisten automatisch deiner
fr: à votre liste de lecture

# homePageSpan3
source: playlist
de: Playlist hinzu

# btnOk
source: ok
fr: d'accord

# ytLabelText
source: YouTube playlist URL
fr: YouTube liste de lecture URL
